#include <stdio.h>
 int main()

/*======================================================
   將0x1234的bit3~4保留，其餘設0，最後將其設定為0x011b
======================================================*/

//a   =0001-0010-0011-0100  =0x1234
//and =0000-0000-0001-0000  =0x0010
//b   =0000-0000-0001-0000  =0x0010
//or  =0000-0001-0001-1011  =0x011b
//c   =0000-0001-0001-1011  =0x011b

 {
   unsigned short a,b,c,d,mask1,mask2; //範圍0~255

   a=0x1234; //a為初始值
   mask1=0x0010;
   mask2=0x011b;


   b=a&mask1; //a and mask
   c=b|mask2; //b轉成0x11b


    printf("1.初始值: %#x\n",a);
    printf("2.將bit3~bit4的值取出，其餘設為0後，其結果: %#x\n",b);
    printf("3.將其設定為0x011b，其結果: %#x\n",c);



    return 0;
 }

