#include <stdio.h>

int main()
{
    //李常光AIS-R3及BKQ貨款代墊案
    //總金額RMB.43,370元
    //2025年1月16日首付款:RMB.21,685元; 實際付款:NTD.100,543+海外信用卡1.5%=102,051 (21,685+支付寶手續費650.55=22,335.55)
    //2025年3月6日到貨尾款:RMB.21,685元
    float a = 22335.55, b = 21685.0, c=102051.0;
    float d = b * 5;
    printf("實際付款(A):CNY.%.2f(含支付寶手續費:650.55)\n",a);
    printf("公司請款(B):CNY.%.2f(李常光收到的款項)\n",b);
    printf("實際付款(C):NTD.%.2f(含支付寶手續費+海外刷卡手續費:1508)\n",c);
    printf("公司請款(D):NTD.%.2f\n",d);
    printf("差額(C-D):%.2f\n",c-d);
    return 0;
}